<template>
  <b-table-lite
    :items="smallRepairPrices"
    :fields="fields"
    hover
    class="prices__table"
  />
</template>

<script lang="ts">
import { Vue, Component } from 'nuxt-property-decorator';

@Component({})
export default class SmallRepair extends Vue {
  fields: BvTableFieldArray = [
    {
      key: 'name',
      label: 'Наименование',
      tdClass: 'name-column'
    },
    {
      key: 'price',
      label: 'Стоимость'
    }
  ];

  smallRepairPrices: PriceItem[] = [
    {
      name: 'Пришить пуговицу на тонкую ткань / толстую ткань / кожу или мех',
      price: '80 — 150 — 200',
    },
    {
      name: 'Пришить крючок: маленький / большой',
      price: '150 — 250'
    },
    {
      name: 'Пришить кнопку на ткань / на кожу',
      price: '150 — 300'
    },
    {
      name: 'Петля сорочечная / в рамку / с глазком',
      price: '150 — 300 — 300'
    },
    {
      name: 'Установить люверс: маленький / большой',
      price: '100 — 250'
    },
    {
      name: 'Установить кнопку',
      price: '100 — 250'
    },
    {
      name: 'Изготовить и пришить шлевку',
      price: '250'
    },
    {
      name: 'Изготовить и пришить вешалку',
      price: 'от 500'
    },
    {
      name: 'Настрочить эмблему, нашивку',
      price: '500 — 1 000'
    },
    {
      name: 'Штопка машинная',
      price: '500 — 2 500'
    },
    {
      name: 'Обработать роликовым швом край ткани 1 м',
      price: '350'
    },
    {
      name: 'Обработать московским (американка) швом край ткани 1 м',
      price: '700',
    },
    {
      name: 'Усилить шов клеевой тканью',
      price: 'от 500',
    },
    {
      name: 'Ремонт разрывов на шлицах, разрезах: ткань / кожа / мех',
      price: '1 100 — 2 000 — 3 000',
    },
    {
      name: 'Изготовить карманы: накладной, прорезной: ткань / кожа / мех',
      price: '1 200 — 1 800 — 2 300',
    },
    {
      name: 'Изготовить пояс: ткань / кожа / мех',
      price: '1 200 — 1 800 — 2 300',
    },
    {
      name: 'Восстановить потайной шов',
      price: '300 — 1 500',
    },
    {
      name: 'Изготовить и пришить бретели',
      price: '600 — 1 500',
    },
    {
      name: 'Отделочные работы кружевом, рюшами, тесьмой 1 м',
      price: 'от 250',
    },
    {
      name: 'Ручные работы 1 м',
      price: 'от 250',
    },
  ];
}
</script>
